app/views/projects/index.html.erb

SELECT "projects".* FROM "projects" ORDER BY created_at DESC
---
            <option value="nil"></option>
            <%-Project.all.map(&:project_type).uniq.each do |p|%>