app/views/posts/index.html.erb

SELECT "posts".* FROM "posts" ORDER BY created_at DESC
SELECT COUNT(*) FROM "posts"
---
        <%-else %>
            <%-if Post.notDrafted.any? %>