app/controllers/homepage_controller.rb

  def home
    @projects = Project.where(pinned_project: true).limit(5)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."pinned_project" = $1 ORDER BY created_at ASC LIMIT $2  [["pinned_project", "t"], ["LIMIT", 5]]