app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY created_at DESC
SELECT  "posts".* FROM "posts" ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 15], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"
---
  def index
    @posts = Post.all
    @posts= @posts.paginate(:page => params[:page], :per_page => 15)

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "sdfffsfsd"], ["content", "<p>fsdfsfsf</p>"], ["created_at", "2017-06-27 18:59:40.314784"], ["updated_at", "2017-06-27 18:59:40.314784"]]
---
  def create
    @post = Post.new(post_params)
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "vdfvfvdvvfdvdvfdvf"], ["updated_at", "2017-06-16 04:31:14.902193"], ["id", 2]]
---
  def update
    @post = Post.find(params[:id])
    if @post.update_attributes(post_params)