app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" ORDER BY created_at DESC
SELECT  "projects".* FROM "projects" ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "projects"
---
  def index
    if current_admin
      @projects = Project.all
    else
      @projects = Project.notDrafted
    end

    @projectsForTags = project_types_as_array(Project).sort()
    @projectsForInProgress = project_types_as_array(Project).sort()
    @projects = @projects.order("created_at DESC").paginate(:page => params[:page], :per_page => 6)

INSERT INTO "projects" ("title", "content", "created_at", "updated_at", "description") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "sfs"], ["content", "<p>sdfsf</p>"], ["created_at", "2017-06-27 18:59:51.721502"], ["updated_at", "2017-06-27 18:59:51.721502"], ["description", "sff"]]
---
  def create
    @project = Project.new(project_params)

    if @project.save

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def show
    @project = Project.find_by(title: params[:id]) || Project.find_by(id: params[:id])

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "projects" SET "description" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["description", "Building a website"], ["updated_at", "2017-06-16 06:29:10.936186"], ["id", 1]]
---
  def update
    @project = Project.find(params[:id])
    if @project.update_attributes(project_params)

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "projects" SET "updated_at" = ?, "pinned_project" = ? WHERE "projects"."id" = ?  [["updated_at", "2017-06-21 23:38:43.827562"], ["pinned_project", "f"], ["id", 1]]
---
  def pinOrUnpinProject
    project = Project.find(params[:id])

    if project.pinned_project == true
      project.update_attributes(pinned_project: false)

SELECT "projects".* FROM "projects"
---
  def getProjectTypesAsJson
    render_project_types_as_json(Project.all)

SELECT "projects".* FROM "projects" ORDER BY created_at DESC
SELECT "projects".* FROM "projects" WHERE "projects"."project_type" = $1 ORDER BY created_at DESC  [["project_type", "hey"]]
---
  def getProjectTypePartial
  array = []
    if current_admin
      if params[:project_type] != "InProgress"
        Project.all.each do |project|
          if project.project_type.include? params[:project_type].gsub('_',' ')