app/controllers/tinymce_assets_controller.rb

  def create
    geometry = Paperclip::Geometry.from_file params[:file]
    image    = Image.create params.permit(:file, :alt, :hint)
---
INSERT INTO "images" ("file_file_name", "file_content_type", "file_file_size", "file_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)